<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<html>
<head>
<title>Core Warrior : Histoire de Core War</title>
</head>

<body bgcolor="#000000" text="#FFCC00" link="#FF0000" vlink="#FFCC00">
<font color="#FF0000"><h1>Histoire de Core War</h1></font>

<p>
A l'origine de tout est un article de A.K. Dewdney "Deux programmes ennemis s'affrontent &agrave; coups de chiffres binaires" paru dans "Pour la science". Cet article (comme beaucoup d'autres du meme auteur pour lequel j'ai le plus grand respect) a provoqu&eacute; un v&eacute;ritable engoument pour cette forme comtemporaine des jeux du cirque o&ugrave; les gladiateurs sont des programmes informatiques.

<p>
L'id&eacute;e de ce jeu est venue &agrave; l'auteur apr&egrave;s qu'il est entendu une anecdote (fausse, mais c'est un d&eacute;tail) qui parlait d'un programme (Creeper) se dupliquant lui meme lorsqu'il &eacute;tait ex&eacute;cut&eacute;. Ce programme envahissant progressivement le r&eacute;seau de la soci&eacute;t&eacute; o&ugrave; il avait &eacute;t&eacute; d&eacute;velopp&eacute; n'a pu etre &eacute;radiqu&eacute; qu'&agrave; l'aide d'un autre programme (Reaper) dont la mission &eacute;tait de traquer et d&eacute;truire les exemplaires de Creeper qu'il rencontrait puis de se d&eacute;truire lui meme.

<p>
L'auteur propose dans cet article un langage informatique simple (proche de l'assembleur) pour coder de petits programmes belliqueux : le <font color="#FF0000">Red Code</font>. Pour une description d&eacute;taill&eacute;e de ce langage, voir la rubrique "Red Code" du menu ci-contre. Les programmes s'ex&eacute;cutent dans la m&eacute;moire d'un ordinateur "virtuel" constitu&eacute;e de 8000 cases. Chaque case peut contenir une instruction. Les deux programmes sont install&eacute;s all&eacute;atoirement dans une case de la m&eacute;moire, puis une instruction de chacun est ex&eacute;cut&eacute;e successivement jusqu'&agrave; ce qu'un des deux programmes plante (par exemple si le pointeur de l'instruction &agrave; ex&eacute;cuter pointe sur une case contenant une donn&eacute;e) ou que la partie soit nulle (apr&egrave;s un nombre de cycles d&eacute;termin&eacute; sans plantage d'un des concurrents). Le dernier programme op&eacute;rationnel &eacute;tant le vainqueur.

<p>
De nombreux programmeurs se sont pris au jeu, et rapidement des tournois se sont organis&eacute;. Il a &eacute;t&eacute; &eacute;crit de nombreuses versions de machines virtuelles pour faire tourner ces programmes Red Code (dont la plus c&eacute;l&egrave;bre est sans aucun doute Mars) et encore maintenant des comp&eacute;titions permanentes ont lieu sur des sites o&ugrave; les concurrents d&eacute;posent leurs programmes. Les versions du langage Red Code se sont succ&eacute;d&eacute;es (84, 86 et 88), et la derni&egrave;re en date est la version 94.

<p>
Ce que Dewdney n'avait pas pr&eacute;vu, c'est que des esprits perfides ont eu l'id&eacute;e de programmer des gladiateurs en langage machine pour infecter de vraies syst&egrave;mes. C'&eacute;tait la naissance des virus informatiques qui allaient se r&eacute;pendre comme une train&eacute;e de poudre. Il explique les cons&eacute;quences de son id&eacute;e dans un autre articles "Virus, parasites et autres maladies des ordinateurs", mais il &eacute;tait un peu tard... C'est le propre des grands esprits de provoquer des mouvements qui les d&eacute;passent, et Core War allait engendrer une descendance nombreuse et particuli&egrave;rement virulente !

<font color="#FF0000"><h1>Liens Core War</h1></font>

<p>
La r&eacute;f&eacute;rence absolue de Core War est la s&eacute;rie d'articles parus dans Scientific American (et traduits dans "Pour la Science"). Ces articles sont disponibles (sous forme d'images JPG, longues &agrave; t&eacute;l&eacute;charger...) &agrave; l'adresse :

<p>
<a href="http://www.koth.org/info/sciam">www.koth.org/info/sciam</a>

<p>
Le site internet de r&eacute;f&eacute;rence me semble etre King Of The Hill (koth pour les intimes) &agrave; l'adresse :

<p>
<a href="http://www.koth.org">www.koth.org</a>

<p>
On peut y t&eacute;l&eacute;charger les instructions pour r&eacute;aliser une Machine Virtuelle Core War (il y est fait r&eacute;f&eacute;rence dans le premier article de Dewdney), les standards Core War (88 et 94) ainsi que de nombreux tutorials et exemples de Guerriers.

<p>
Enfin, il faut noter une s&eacute;rie d'articles dans le "Virus informatique" ( &agrave; partir du num&eacute;ro 8) avec le code d'un compilo et d'un VM en Basic. Le site du Virus est &agrave; l'adresse :

<p>
<a href="http://www.acbm.com">www.acbm.com</a>

<br>

<hr>
<address><a href="mailto:casa@sdv.fr">Michel CASABIANCA</a></address>
<!-- Created: Sun Nov 29 02:22:46 CET 1998 -->
<!-- hhmts start -->
Last modified: Mon Nov 30 14:28:53 CET 1998
<!-- hhmts end -->
</body>
</html>
