<HTML>
<HEAD>
<TITLE>Core Warrior : T&eacute;l&eacute;chargement</TITLE>
</HEAD>

<BODY TEXT="#FFCC00" BGCOLOR="#000000" LINK="#FF0000" VLINK="#FFCC00">
<P><H1>T&eacute;l&eacute;chargement</H1></P>

<p><H3><FONT COLOR="FF0000">Notice l&eacute;gale a lire avant tout t&eacute;l&eacute;chargement</FONT></H3></p>

<P>
Ce programme est "freeware" et livr&eacute; tel quel, sans aucune garantie d'aucune sorte et sans support technique. L'auteur ne pourrait &ecirc;tre tenu pour responsable de toute perte de donn&eacute;es, de temps ou autre. Il ne peut &ecirc;tre fait usage commercial de ce programme sans autorisation &eacute;crite de l'auteur.
</P>

<P>
Le fait de t&eacute;l&eacute;charger ce programme implique l'acceptation de ces conditions d'utilisation.
</P>

<p><H3><FONT COLOR="FF0000">A installer avant Core Warrior</FONT></H3></p>

<P>
Ce programme n&eacute;c&eacute;ssite une machine virtuelle (VM) java 1.1 pour fonctionner. Sun met gratuitement &agrave; disposition des utilisateurs une VM pour les PC et stations Sun. On peut les t&eacute;l&eacute;charger sur leur page : <A HREF=http://java.sun.com/products>http://java.sun.com/products</A>. Une VM pour Linux peut etre charger sur le site Java-Linux <a href="http://www.blackdown.org">http://www.blackdown.org</a>. Des VM existent pour quasiment toutes les plateformes, pour plus de d&eacute;tails voire le site de Sun.
</P>

<p>
La documentation est incluse dans l'archive du programme.
</p>

<CENTER>
<TABLE BORDER=2 BGCOLOR="808080" CELLPADDING=10>
<TR ALIGN=CENTER>
<TD ALIGN=CENTER>Description</TD>
<TD ALIGN=CENTER>Fichier</TD>
<TD ALIGN=CENTER>Taille</TD>
</TR>

<TR ALIGN=CENTER>
<TD ALIGN=LEFT>Programme</TD>
<TD ALIGN=CENTER><A HREF="CoreWarrior-0.1.zip">CoreWarrior-0.1.zip</A></TD>
<TD ALIGN=LEFT> ko</TD>
</TR>
</TABLE>
</CENTER>

<P>
Pour installer le programme, d&eacute;zipper les archives dans un r&eacute;pertoire (par exemple /usr/local/corewarrior ou  c:\corewarrior), c'est tout ! Pour une mise &agrave; jour, d&eacute;zipper l'archive dans le r&eacute;pertoire du programme d&eacute;ja install&eacute;. Pour d&eacute;sinstaller le programme, il suffit d'effacer le r&eacute;pertoire.
</P>

<hr>
<address><a href="mailto:casa@sdv.fr">Michel CASABIANCA</a></address>
<!-- Created: Sun Nov 29 02:22:46 CET 1998 -->
<!-- hhmts start -->
Last modified: Sun Nov 29 22:46:52 CET 1998
<!-- hhmts end -->
</body>
</html>
